
characters_of_the_dream = [
    {
        "id": "shixiangyun",
        "name": "史湘云",
        "affiliation": "unknown",
        "description": "史湘云是曹雪芹所著中国古典名著《红楼梦》中的主要人物，\
            金陵十二钗之一，金陵省贾、史、王、薛四大家族史家的千金，父母在她还是襁褓时就已经亡故，\
            由叔叔婶婶养育。她是贾母的内侄孙女，贾府通称史大姑娘。\
            史湘云是一个富有浪漫色彩的豪爽女性。她是薄命司中的女儿，\
            自幼父母双亡，由于史家经济拮据，也没有过上贵族小姐的生活；\
            但她生性豁达乐观，恣意潇洒。经史湘云的判词中推测，她最后嫁了一位郎君，\
            但夫婿很快亡故，过着拮据的孤寡生活。",
        "opacity": 1
    },
    {
        "id": "xuebaochai",
        "name": "薛宝钗",
        "affiliation": "cyan",
        "description": "薛宝钗，是曹雪芹著长篇章回体小说《红楼梦》中的女主角之一，\
            与林黛玉并列为金陵十二钗之首，贾宝玉的从母姊（姨姊）。\
            她容貌丰美，举止娴雅，博学多才，因此受到贾府上下一致好评。\
            父亲（薛姨父）早亡，有母亲（薛姨妈）和哥哥（薛蟠）。\
            宝钗进京后与母亲薛姨妈、哥哥薛蟠暂住于贾府的梨香院，后迁居于东北上一处幽静的房所。",
        "opacity": 1
    },
    {
        "id": "huangjinying",
        "name": "莺儿",
        "affiliation": "cyan",
        "description": "莺儿，本名黄金莺，《红楼梦》中薛宝钗的丫头。因薛宝钗嫌金莺拗口，改叫莺儿。\
            她甚是乖巧，薛宝钗在观看通灵宝玉，念著玉上所镌之文“莫失莫忘，仙寿恒昌”时，\
            她马上想到这和小姐项圈上的两句话是一对儿。\
            她手特巧，擅长打络子、编花篮等，还颇懂色彩的搭配。",
        "opacity": 1
    },
    {
        "id": "lindaiyu",
        "name": "林黛玉",
        "affiliation": "red",
        "description": "林黛玉，中国古典名著《红楼梦》的女主角，金陵十二钗正册双首之一，\
            西方灵河岸绛珠仙草转世，荣府幺女贾敏与扬州巡盐御史林如海之独生女，\
            母亲贾敏是贾代善和贾母四个女儿里最小的女儿，贾母的外孙女，\
            贾宝玉的姑表妹、恋人、知己，贾府通称林姑娘。",
        "opacity": 1
    },
    {
        "id": "ruiguan",
        "name": "蕊官",
        "affiliation": "unknown",
        "description": "蕊官，出自于曹雪芹小说《红楼梦》。红楼十二官之一，梨香院女伶，戏班解散后为薛宝钗的丫鬟。",
        "opacity": 1
    },
    {
        "id": "ouguan",
        "name": "藕官",
        "affiliation": "unknown",
        "description": "藕官是小说《红楼梦》中的女性人物。\
            贾家买来的十二个唱戏的优伶之一，小戏子。为人义气，当她的朋友芳官被赵姨娘侮辱时，\
            藕官冒着随时被驱逐的危险和伙伴们一起将身为主子的赵姨娘打了个痛快。\
            戏班解散后，她成了林黛玉的丫环。先后和菂官、蕊官是同性恋人。",
        "opacity": 1
    },
    {
        "id": "xueyima",
        "name": "薛姨妈",
        "affiliation": "cyan",
        "description": "薛姨妈，古典小说《红楼梦》中的人物，薛蟠和薛宝钗之母，王夫人之妹。\
            她出身于“东海缺少白玉床，龙王来请金陵王”的都太尉统制县伯王家，嫁入“丰年好大雪，\
            珍珠如土金如铁”的紫薇舍人之后、金陵首富皇商薛家，是一位世家出身的豪门贵夫人。\
            她以“慈”著称，由于举止言行得体，贾母常愿与她对坐聊天。\
            她十分溺爱自己的孩子，对举目无亲的林黛玉也尤为怜爱，认其作干女儿。\
            薛姨妈尤其怜惜薛蟠独根孤种，未免溺爱纵容，遂至老大无成，任薛蟠在外为所欲为。",
        "opacity": 1
    },
    {
        "id": "chunyan",
        "name": "春燕",
        "affiliation": "unknown",
        "description": "春燕是《红楼梦》中的人物，何婆子之女，\
            贾宝玉房内的二等丫鬟，贾府内世仆的女孩，聪明伶俐乐于助人。",
        "opacity": 1
    },
    {
        "id": "jiabaoyu",
        "name": "贾宝玉",
        "affiliation": "red",
        "description": "贾宝玉，中国古典名著《红楼梦》中的男主角。\
            前世真身为赤霞宫神瑛侍者，荣国府贾政与王夫人所生的次子。\
            因衔通灵宝玉而诞，系贾府玉字辈嫡孙，故名贾宝玉，贾府通称宝二爷。\
            贾宝玉自幼深受贾母疼爱，游于温柔富贵乡，专爱作养脂粉，亲近家里姐妹和丫鬟；\
            他与林黛玉青梅竹马，互为知己，发展成一段世间少有的纯洁感情；\
            他重情不重礼，结交了秦钟、蒋玉菡、柳湘莲、北静王等有情男子；\
            他喜欢诗词曲赋之类性情文学，厌恶四书和八股文，批判程朱理学，\
            把那些追逐科举考试、仕途经济的封建文人叫做“禄蠹”。\
            可是到头来“瞬息间则又乐极悲生，人非物换”。他所欣赏的女子们死的死，散的散；",
        "opacity": 1
    },
    {
        "id": "hepozi",
        "name": "何婆子",
        "affiliation": "unknown",
        "description": "何婆子，是怡红院中的丫鬟春燕的母亲，\
            她原本，是贾府之中负责浆洗的三等婆子。\
            后来，因为梨香院戏子的解散，她随留下来的芳官归入了怡红院。",
        "opacity": 1
    },
    {
        "id": "chunyanguma",
        "name": "春燕姑妈",
        "affiliation": "unknown",
        "description": "与亲妈和姨妈不同，这位姑妈没有认干女儿，她承包了大观园里柳叶渚的花柳。\
            她与嫂子何婆子关系不错。\
            虽然是姑妈承包的，但却是两个人一起经营。\
            便如春燕所说，她们“每日早睡晚起……老姑嫂两个照看得谨谨慎慎”。\
            如此披星戴月、辛苦操劳，就如农民一样。",
        "opacity": 1
    },
    {
        "id": "xiapozi",
        "name": "夏婆子",
        "affiliation": "unknown",
        "description": "夏婆子是红楼梦中的一个人物，她是藕官的干娘，春燕的姨妈，蝉姐儿的外婆，平日在大观园当差。",
        "opacity": 1
    },
    {
        "id": "fangguan",
        "name": "芳官",
        "affiliation": "unknown",
        "description": "芳官，清代小说《红楼梦》中的女性人物，贾府买来的戏班成员，\
            原姓花，姑苏人氏，正旦。红楼十二官之一。戏班解散后成了贾宝玉的丫环。\
            芳官的男子气概在“洗头事件”和“蔷薇硝事件”中展现得淋漓尽致。\
            芳官在群芳夜宴中唱《赏花时》意蕴深厚。",
        "opacity": 1
    },
    {
        "id": "sheyue",
        "name": "麝月",
        "affiliation": "unknown",
        "description": "麝月，中国古典小说《红楼梦》中人物，是男主人公贾宝玉身边一等丫鬟。\
            怡红院里的四大丫鬟之一，她在书中的出场并不多，但是一个不可缺少的角色。",
        "opacity": 1
    },
    {
        "id": "pinger",
        "name": "平儿",
        "affiliation": "unknown",
        "description": "平儿，中国古典小说《红楼梦》中的人物，王熙凤的陪嫁丫头，\
            贾琏的通房大丫头（妾）。她是个极聪明、极清俊的女孩儿。虽是凤姐的心腹，\
            要帮着凤姐料理事务，但她为人很好，心地善良，常背着王熙凤做些好事。",
        "opacity": 1
    },
    {
        "id": "lindaniang",
        "name": "林大娘",
        "affiliation": "unknown",
        "description": "林大娘是林之孝的妻子。林之孝是荣国府的大管家，掌管着贾府的银库账房，为人低调。\
            林大娘是他的妻子，掌管大观园的事务。贾宝玉的丫鬟小红，是他们的女儿。",
        "opacity": 1
    },
    {
        "id": "linzhixiao",
        "name": "林之孝",
        "affiliation": "unknown",
        "description": "林大娘是林之孝的妻子。林之孝是荣国府的大管家，掌管着贾府的银库账房，为人低调。\
            林大娘是他的妻子，掌管大观园的事务。贾宝玉的丫鬟小红，是他们的女儿。",
        "opacity": 1
    },
    {
        "id": "jiamu",
        "name": "贾母",
        "affiliation": "red",
        "description": "贾母，又称史老太君，贾府上下尊称她为“老太太”、“老祖宗”，\
            是曹雪芹所著中国古典小说《红楼梦》中的主要角色之一，娘家史氏为四大家族之一。\
            贾母是贾府名义上的最高统治者，她是贾赦、贾政和贾敏的母亲，贾宝玉的祖母，\
            林黛玉的外祖母，史湘云是其内侄孙女。",
        "opacity": 1
    },
    {
        "id": "jinyuanyang",
        "name": "鸳鸯",
        "affiliation": "cyan",
        "description": "金鸳鸯是红楼人物之一，四大烈婢之一，她在《红楼梦》一书中，是贾母的大丫头。\
            甚受信任，因为这个缘故，她在贾府的丫头中有很高的地位。贾母平日倚之若左右手。\
            贾母玩牌，她坐在旁边出主意；贾母摆宴，她入座充当令官。",
        "opacity": 1
    },
    {
        "id": "hupo",
        "name": "琥珀",
        "affiliation": "unknown",
        "description": "琥珀，贾母身边的大丫鬟，照顾贾母起居生活，也负责传话、取物等各色杂事。",
        "opacity": 1
    },
    {
        "id": "feicui",
        "name": "翡翠",
        "affiliation": "unknown",
        "description": "翡翠，贾母身边的大丫鬟。",
        "opacity": 1
    },
    {
        "id": "boli",
        "name": "玻璃",
        "affiliation": "unknown",
        "description": "玻璃，贾母身边的大丫鬟。",
        "opacity": 1
    },
    {
        "id": "yuchuan",
        "name": "玉钏",
        "affiliation": "unknown",
        "description": "《红楼梦》中人物，姓白，名玉钏，金钏的妹妹，王夫人的丫头。\
            金钏投井后，王夫人便把金钏的月钱给了玉钏。金钏周年，玉钏独坐廊下垂泪。",
        "opacity": 1
    },
    {
        "id": "caiyun",
        "name": "彩云",
        "affiliation": "unknown",
        "description": "彩云是小说《红楼梦》里的人物，是一个与贾环玩得很要好的丫头。\
            贾环曾为她从芳官处讨些蔷薇硝来，彩云打开一看才知是茉莉粉，赵姨娘非要找芳官算帐，\
            彩云死劝不住，只得躲入房内。后来，她禁不住赵姨娘的再三央求，从王夫人柜子里偷了些东西给贾环，\
            被玉钏儿发觉。平儿为了不使探春难堪，要宝玉应下拿东西的名儿，彩云回来告诉赵姨娘。\
            贾环起了疑心，认为她和宝玉好，并把彩云私赠之物都拿出来，照著她的脸摔了过去。\
            彩云急得赌咒起誓，百般解说。贾环还是不信，气得彩云哭了个泪乾肠断，把东西全扔到河里了。",
        "opacity": 1
    },
    {
        "id": "caixia",
        "name": "彩霞",
        "affiliation": "unknown",
        "description": "彩霞是《红楼梦》中的人物，王夫人的大丫头，有时是赵姨娘身边的二等丫头，\
            非常能干，不仅要提醒王夫人大小家事，就连贾政在家出外去的一应大小家事，也得由她记着。",
        "opacity": 1
    },
    {
        "id": "wangfuren",
        "name": "王夫人",
        "affiliation": "red",
        "description": "王夫人是在中国古典小说《红楼梦》中登场的虚拟人物，她是贾珠、贾元春、贾宝玉之母，\
            贾政之妻，是王熙凤的姑姑，薛姨妈之姐。",
        "opacity": 1
    },
    {
        "id": "rongqi",
        "name": "蓉妻",
        "affiliation": "unknown",
        "description": "贾蓉之妻",
        "opacity": 1
    },
    {
        "id": "jiazhen",
        "name": "贾珍",
        "affiliation": "unknown",
        "description": "贾珍，中国古典小说《红楼梦》中的虚拟角色，贾敬之子，宁国公贾演曾孙。\
            世袭三品爵威烈将军。生活穷奢极欲，为人荒淫无耻；虽妻妾成群，\
            但仍和儿媳秦可卿私通、与妻妹尤二姐尤三姐玩弄暧昧。\
            秦可卿死后，贾珍请王熙凤料理丧事，为丧仪风光，让她“爱怎么办就怎么办”；\
            还特意花一千二百两银子为儿子贾蓉捐了个五品龙禁尉。",
        "opacity": 1
    },
    {
        "id": "youshi",
        "name": "尤氏",
        "affiliation": "unknown",
        "description": "尤氏，别名大奶奶、珍大奶奶、珍哥儿媳妇，是曹雪芹小说《红楼梦》中的人物，贾珍的继室。\
            虽为宁国府当家奶奶，但并无实权，只是顺从贾珍。她没什么才干，也没口齿。\
            尤氏继母为尤老娘，和前夫有两个女儿尤二姐和尤三姐。",
        "opacity": 1
    },
    {
        "id": "jialian",
        "name": "贾琏",
        "affiliation": "unknown",
        "description": "贾琏是古典小说《红楼梦》中的男主角之一，一等将军贾赦之子，人称“琏二爷”。\
            他不喜读书谋官，只捐了个五品同知的官位，和妻子王熙凤住在叔叔贾政家中，帮着料理家务。\
            与贾府其他单纯混吃等死的男人不同，贾琏为人精明能干，荣国府许多大事都是在他的主持下完成的，\
            是荣国府对外的能力担当。缺点是多情好色，和多姑娘、鲍二媳妇和尤二姐数名女子都有着不清不楚的关系，\
            贾母骂他是“香的臭的都往屋里带”。\
            做事有底线、富有一定的同情心，他虽好色但从不去祸害良家女子，找的不是尤二姐这样婚前失了身\
            被人看不起的，就是多姑娘这样“荣宁二府之人都得入手”、“小厮们都与这媳妇是好友”人尽可夫的女子，\
            而且他向来只是利诱从不威逼。贾雨村为了几把扇子把石呆子害得坑家败业他表示斥责，\
            王熙凤要将彩霞配给旺儿品德不好的儿子，他也是气愤的反对。",
        "opacity": 1
    },
    {
        "id": "jiashe",
        "name": "贾赦",
        "affiliation": "unknown",
        "description": "贾赦，中国古典小说《红楼梦》中的虚拟角色，字恩侯，荣国公贾源之孙，\
            贾代善和贾母的长子，贾政、贾敏的长兄，邢夫人的丈夫，贾琏、贾琮、迎春的父亲，是个无耻之徒，\
            袭了一等将军的爵位。\
            生性好色，妾室一片，在第46回中，他想要母亲的贴身丫环鸳鸯做妾，不惜威逼利诱鸳鸯的哥哥，\
            后来遭到贾母的怒斥方才作罢。后用银子买了嫣红来代替鸳鸯。贾赦为人贪婪，平日依官作势，行为多不检。\
            曾与贾雨村勾结，强索石呆子古扇，逼得石呆子愤而自尽。虽上了年纪，儿子、孙子、侄子满堂，\
            却还要左右一个小老婆放在屋里寻欢作乐。贾母也因他“放着身子不保养，官儿也不好生做去，\
            成日里和小老婆喝酒”而不喜爱他；他亦不是个好父亲。儿子贾琏已有了女儿巧姐，他看不惯便一顿毒打；\
            女儿迎春被他作为抵债的工具嫁到孙家，被孙绍祖折磨而死，他也不管。\
            他不满贾母偏向弟弟贾政，与母亲和弟弟貌合神离。",
        "opacity": 1
    },
    {
        "id": "xingfuren",
        "name": "邢夫人",
        "affiliation": "unknown",
        "description": "邢夫人，中国古典小说《红楼梦》虚拟角色。贾赦续弦妻子。虽为贾府大太太，\
            却因地位尴尬而比不上妯娌王夫人。\
            她禀性愚犟，只知奉承贾赦，家中大小事务，俱由丈夫摆布；出入银钱，一经她手，便克扣异常，婪取财货；\
            儿女奴仆，一人不靠，一言不听，故甚不得人心。\
            作为贾家的大儿媳，她没能得到婆婆贾母的欢心和当家的权力，\
            也对儿媳妇王熙凤又一味奉承贾母与王夫人极为不满。她一直伺机反扑，不时给她们制造难堪，\
            如在她发现傻大姐拾得的五彩绣春囊时，便马上派王善保家的交给王夫人，把王夫人“气了个半死”，\
            引发了抄检大观园。",
        "opacity": 1
    },
    {
        "id": "laida",
        "name": "赖大",
        "affiliation": "unknown",
        "description": "赖大：《红楼梦》的人物（首见第十六回），赖嬷嬷之子，赖尚荣之父。\
            是“熬了两三辈子，好容易挣出”来的“家生子儿”，因为赖嬷嬷“年高服侍过”贾府的老主子，\
            又得到贾母的“赏脸”，他才做了荣府大总管。",
        "opacity": 1
    },
    {
        "id": "zijuan",
        "name": "紫鹃",
        "affiliation": "unknown",
        "description": "紫鹃，《红楼梦》中的人物，原名鹦哥，是贾母房里的二等小丫头。\
            贾母见林黛玉来时只带了两个人，恐不中使，便把鹦哥给了黛玉，改名为紫鹃。\
            她聪明灵慧，和黛玉关系很好，情同姐妹，一时一刻不离开，是黛玉的“闺中贵友”，\
            一心一意为黛玉着想，见黛玉是个孤儿，又和贾宝玉相爱，就劝黛玉趁老太太还硬朗的时候作定大事要紧。\
            为此，她想出林家要接黛玉回苏州的话来试宝玉，使宝玉痴病大发。",
        "opacity": 1
    },
    {
        "id": "huaxiren",
        "name": "花袭人",
        "affiliation": "unknown",
        "description": "袭人：全名“花袭人”，曹雪芹所著中国古典小说《红楼梦》中的重要人物，\
            金陵十二钗又副册第二位，宝玉房里大丫鬟之首。原名珍珠(程乙本作“蕊珠”)。\
            她以“贤”、“花解语”著称，从小因家贫被父母卖入贾府为婢，原是跟着贾母，起先服侍史湘云几年，\
            贾母见袭人心地纯良，恪尽职守，便命她服侍贾宝玉，成为贾宝玉的首席丫鬟。\
            曾与贾宝玉“偷试云雨情”，最终嫁给蒋玉菡。",
        "opacity": 1
    },
    {
        "id": "qingwen",
        "name": "晴雯",
        "affiliation": "unknown",
        "description": "晴雯，中国古典小说《红楼梦》中的人物，金陵十二钗又副册之首，\
            贾宝玉房里的四个大丫鬟之一，虽是丫鬟，但在宝玉房里过得千金小姐的生活。\
            她以“勇”著称，红学中亦评价她有林黛玉之风。她长得风流灵巧，眉眼儿有点像林黛玉，\
            口齿伶俐，针线活尤好，曾为宝玉病补雀金裘。 她本是赖妈妈家的丫鬟，因得贾母喜爱，固把她赐给宝玉。\
            因娇生惯养，养成得理不饶人的性格。一次王夫人进园子看见她打骂小丫鬟，\
            觉得她不合世家教养，再加上王善保家的等小人进谗，王夫人在她病得“四五日水米不曾沾牙”的情况下，\
            从炕上拉下来，硬给撵了出去（放出去）。宝玉偷偷前去探望，晴雯深为感动。\
            当夜，晴雯悲惨地死去。听小丫头说晴雯死后做了芙蓉花神，宝玉便作了篇长长的《芙蓉女儿诔》寄托哀思。",
        "opacity": 1
    },
    {
        "id": "xiaojiuer",
        "name": "小鸠儿",
        "affiliation": "unknown",
        "description": "小鸠儿，何婆之女，春燕之妹。\
            很少出场，也没有什么独立的故事，但与小鸠儿有关联的人物较多。各自展开故事情节。",
        "opacity": 1
    },
    {
        "id": "renwu_template_id",
        "name": "人物模板",
        "affiliation": "unknown",
        "description": "人物模板描述",
        "opacity": 1
    },
];


